BlackPear/test cases/smsp.getPatientDetails.match when using rich parameters.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:itk="urn:nhs-itk:ns:201005">
    <soap:Header>
        <wsa:MessageID>1d2020f1-9035-4b86-9a5a-0a1db414591e</wsa:MessageID>
        <wsa:Action>urn:nhs-itk:services:201005:getPatientDetails-v1-0</wsa:Action>
        <wsa:To>https:&#x2F;&#x2F;192.168.128.11&#x2F;smsp&#x2F;pds</wsa:To>
        <wsa:From>
            <wsa:Address>http:&#x2F;&#x2F;dev.blackpear.com</wsa:Address>
        </wsa:From>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="84c51952-1f67-463c-b098-82977f6e0576">
                <wsu:Created>2018-05-22T12:46:55.072Z</wsu:Created>
                <wsu:Expires>2018-05-22T13:06:55.073Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken>
                <wsse:Username>blackpear</wsse:Username>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <itk:DistributionEnvelope>
            <itk:header service="urn:nhs-itk:services:201005:getPatientDetails-v1-0" trackingid="E41B6C86-982B-4713-A495-6C846A0262A3">
                <itk:auditIdentity>
                    <itk:id type="2.16.840.1.113883.2.1.3.2.4.18.27" uri="urn:nhs-uk:identity:ods:8HV05:warden.blackpear.com:user@nhs.net"/>
                    <itk:id type="1.2.826.0.1285.0.2.0.107" uri="918999199395" />
                </itk:auditIdentity>
                <itk:manifest count="1">
                    <itk:manifestitem id="uuid_E5B7338C-14AA-41C1-AD7C-B31FDF8B6CBE" mimetype="text/xml" profileid="urn:nhs-en:profile:getPatientDetailsRequest-v1-0" metadata="false" base64="false" compressed="false" encrypted="false"/>
                </itk:manifest>
                <itk:senderAddress uri="urn:nhs-uk:addressing:ods:8HV05"/>
            </itk:header>
            <itk:payloads count="1">
                <itk:payload id="uuid_E5B7338C-14AA-41C1-AD7C-B31FDF8B6CBE">
                    <getPatientDetails-v1-0 xmlns="urn:hl7-org:v3" moodCode="EVN" classCode="CACT">
                        <id root="1297367D-4F1C-4A00-8608-96804AE846EB"/>
                        <code codeSystem="2.16.840.1.113883.2.1.3.2.4.17.284" code="getPatientDetailsRequest-v1-0"/>
                        <queryEvent>
                            <Person.DateOfBirth>
                                <value value="20110614"/>
                                <semanticsText>Person.DateOfBirth</semanticsText>
                            </Person.DateOfBirth>
                            <Person.Gender>
                                <value code="1" codeSystem="2.16.840.1.113883.2.1.3.2.4.16.25"/>
                                <semanticsText>Person.Gender</semanticsText>
                            </Person.Gender>
                            <Person.Name>
                                <value>
                                    <given>GORE*</given>
                                    <family>PHONANAN*</family>
                                </value>
                                <semanticsText>Person.Name</semanticsText>
                            </Person.Name>
                            <Person.Postcode>
                                <value>
                                    <postalCode>KT21 2BE</postalCode>
                                </value>
                                <semanticsText>Person.Postcode</semanticsText>
                            </Person.Postcode>
                        </queryEvent>
                    </getPatientDetails-v1-0>
                </itk:payload>
            </itk:payloads>
        </itk:DistributionEnvelope>
    </soap:Body>
</soap:Envelope>